In [1]:
import numpy as np 
import pandas as pd

In [2]:
manish=pd.read_csv("C:\\Users\\BHARAMAN\\Downloads\\placement - placement.csv")

In [3]:
manish

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [4]:
manish.head(5) # top 5 Data

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1

In [5]:
manish.tail(5) # bottom 5 Data

    cgpa  resume_score  placed
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [6]:
 manish.describe()# statically view of Data

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [7]:
manish.info()#Data type information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cgpa          100 non-null    float64
 1   resume_score  100 non-null    float64
 2   placed        100 non-null    int64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [11]:
top_left_corner_df=manish.iloc[:4,:3] # iloc [row_rang,column_range]
top_left_corner_df

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1

In [12]:
manish.loc[1:3,['cgpa','placed']]  # loc[row_range,column_names]

   cgpa  placed
1  6.17       0
2  8.27       1
3  6.88       1

In [13]:
  manish.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['cgpa', 'resume_score', 'placed'], dtype='object')]

In [15]:
manish.dtypes

cgpa            float64
resume_score    float64
placed            int64
dtype: object

In [16]:
manish.empty ### it return true if  ther any missing Datato DataFaram otherwise return Fales

False

In [17]:
manish.ndim  # number of axes (it is 2)

2

In [18]:
manish.shape # shape=n(row),n(colunm)

(100, 3)

In [19]:
manish.size #  row*count,colunm*count

300

In [21]:
manish.values # get  a numpy for  manish

array([[8.14, 6.52, 1.  ],
       [6.17, 5.17, 0.  ],
       [8.27, 8.86, 1.  ],
       [6.88, 7.27, 1.  ],
       [7.52, 7.3 , 1.  ],
       [8.77, 6.19, 1.  ],
       [5.34, 7.09, 0.  ],
       [6.56, 6.29, 0.  ],
       [6.32, 6.71, 0.  ],
       [7.69, 7.12, 1.  ],
       [6.18, 6.35, 0.  ],
       [5.44, 6.54, 0.  ],
       [6.09, 7.01, 0.  ],
       [8.5 , 5.09, 1.  ],
       [7.51, 6.25, 1.  ],
       [8.88, 5.93, 1.  ],
       [8.04, 7.64, 1.  ],
       [7.81, 8.71, 1.  ],
       [5.94, 5.88, 0.  ],
       [6.75, 8.11, 1.  ],
       [5.8 , 8.06, 0.  ],
       [6.53, 7.64, 0.  ],
       [6.16, 5.77, 0.  ],
       [6.05, 7.13, 0.  ],
       [8.22, 6.18, 1.  ],
       [7.76, 5.68, 1.  ],
       [6.27, 6.47, 0.  ],
       [5.51, 6.15, 0.  ],
       [7.46, 7.67, 1.  ],
       [6.19, 7.3 , 0.  ],
       [7.36, 7.15, 1.  ],
       [5.92, 7.02, 0.  ],
       [5.87, 7.96, 0.  ],
       [8.43, 7.73, 1.  ],
       [8.87, 7.19, 1.  ],
       [8.07, 7.48, 1.  ],
       [8.16, 7.56, 1.  ],
       [9.05, 8.21, 1.  ],
       [6.  , 8.72, 0.  ],
       [7.5 , 6.19, 1.  ],
       [8.25, 5.32, 1.  ],
       [8.68, 5.15, 1.  ],
       [6.9 , 6.91, 1.  ],
       [8.21, 7.95, 1.  ],
       [5.47, 5.92, 0.  ],
       [8.1 , 5.44, 1.  ],
       [5.83, 5.21, 0.  ],
       [7.05, 8.14, 1.  ],
       [5.54, 6.57, 0.  ],
       [5.46, 6.73, 0.  ],
       [8.22, 6.74, 1.  ],
       [6.54, 7.39, 0.  ],
       [5.9 , 7.5 , 0.  ],
       [6.  , 7.16, 0.  ],
       [5.92, 7.18, 0.  ],
       [6.94, 6.87, 1.  ],
       [6.13, 6.43, 0.  ],
       [6.34, 7.21, 0.  ],
       [6.47, 7.37, 0.  ],
       [5.95, 7.57, 0.  ],
       [5.87, 6.64, 0.  ],
       [6.89, 7.96, 1.  ],
       [5.75, 8.43, 0.  ],
       [8.65, 7.58, 1.  ],
       [7.93, 8.09, 1.  ],
       [6.04, 8.75, 0.  ],
       [8.35, 8.02, 1.  ],
       [6.59, 6.81, 1.  ],
       [6.01, 7.49, 0.  ],
       [8.06, 9.06, 1.  ],
       [7.12, 7.41, 1.  ],
       [7.34, 8.22, 1.  ],
       [7.63, 7.98, 1.  ],
       [5.76, 6.48, 0.  ],
       [5.54, 7.36, 0.  ],
       [6.34, 7.94, 1.  ],
       [9.4 , 5.5 , 1.  ],
       [5.88, 6.92, 0.  ],
       [5.79, 5.66, 0.  ],
       [5.27, 7.28, 0.  ],
       [7.83, 7.7 , 1.  ],
       [6.12, 6.72, 0.  ],
       [7.92, 6.06, 1.  ],
       [7.6 , 8.08, 1.  ],
       [5.76, 6.49, 0.  ],
       [6.72, 5.46, 0.  ],
       [6.18, 5.76, 0.  ],
       [5.62, 5.05, 0.  ],
       [8.07, 6.07, 1.  ],
       [5.99, 7.49, 0.  ],
       [5.85, 5.56, 0.  ],
       [8.28, 6.3 , 1.  ],
       [5.43, 6.18, 0.  ],
       [9.31, 7.39, 1.  ],
       [8.01, 4.95, 1.  ],
       [6.33, 6.38, 0.  ],
       [8.23, 7.76, 1.  ],
       [6.65, 7.78, 0.  ],
       [8.14, 5.63, 1.  ],
       [6.09, 6.61, 0.  ]])

In [ ]:
 manish.copy()

In [22]:
manish.sort_values(by='resume_score')

    cgpa  resume_score  placed
94  8.01          4.95       1
87  5.62          5.05       0
13  8.50          5.09       1
41  8.68          5.15       1
1   6.17          5.17       0
..   ...           ...     ...
17  7.81          8.71       1
38  6.00          8.72       0
65  6.04          8.75       0
2   8.27          8.86       1
69  8.06          9.06       1

[100 rows x 3 columns]

In [23]:
manish.sort_index()

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [27]:
 # x= manish.astype(int) # type converstion

In [74]:
 manish['cgpa'].astype(int)   
# manish

0     24
1     22
2     24
3     22
4     23
      ..
95    22
96    24
97    22
98    24
99    22
Name: cgpa, Length: 100, dtype: int32

In [72]:
# x = df.astype(int)   # type conversion 
manish['cgpa'] = manish['cgpa'].astype(int)
# df

In [76]:
# t = manish.add(4)
manish['cgpa'].add(4)

0     28
1     26
2     28
3     26
4     27
      ..
95    26
96    28
97    26
98    28
99    26
Name: cgpa, Length: 100, dtype: int32

In [40]:
 manish.count() #  any column  Frequency

cgpa            100
resume_score    100
placed          100
dtype: int64

In [41]:
manish.max() # any column  maximum number

cgpa            21.00
resume_score     9.06
placed           1.00
dtype: float64

In [42]:
manish.min() # any column minimum number

cgpa            17.00
resume_score     4.95
placed           0.00
dtype: float64

In [43]:
manish.mean() # any number of average

cgpa            18.4700
resume_score     6.9305
placed           0.5000
dtype: float64

In [45]:
manish.median()  # any number  median

cgpa            18.000
resume_score     7.055
placed           0.500
dtype: float64

In [46]:
manish.sum()   # any column total

cgpa            1847.00
resume_score     693.05
placed            50.00
dtype: float64

In [77]:
manish.filter(items = ['cgpa','placed'] )
# manish[['cgpa','placed']]  ## secoeand option of filtering

    cgpa  placed
0     24       1
1     22       0
2     24       1
3     22       1
4     23       1
..   ...     ...
95    22       0
96    24       1
97    22       0
98    24       1
99    22       0

[100 rows x 2 columns]

In [51]:
s=manish.filter(items =[5,6], axis=0)  ### axis means row wise opera tion
s

   cgpa  resume_score  placed
5    20          6.19       1
6    17          7.09       0

In [54]:
s= manish.to_dict()  ## save to dictionary
# s

In [57]:
q=manish.to_string()  ## save to strings
# q

In [59]:
m = manish.columns
m

Index(['cgpa', 'resume_score', 'placed'], dtype='object')

In [60]:
mk = manish.columns[0]  ##   first column 
mk

'cgpa'

In [61]:
mo = manish.columns.tolist()  ##   list of column labls
mo

['cgpa', 'resume_score', 'placed']

In [64]:
o = manish.columns.values ##3 array of colums lable
o

array(['cgpa', 'resume_score', 'placed'], dtype=object)

In [78]:
p = manish.rename(columns={ 'cgpa':'half_yearly_marks',
                           'resume_score':'semester_marks'})  #  How to rename a coiumn
p

    half_yearly_marks  semester_marks  placed  half
0                  24            6.52       1     0
1                  22            5.17       0     0
2                  24            8.86       1     0
3                  22            7.27       1     0
4                  23            7.30       1     0
..                ...             ...     ...   ...
95                 22            6.38       0     0
96                 24            7.76       1     0
97                 22            7.78       0     0
98                 24            5.63       1     0
99                 22            6.61       0     0

[100 rows x 4 columns]

In [80]:
manish['half'] = manish['cgpa'].where(manish ['cgpa']>50, other =0)
manish.head(10)

   cgpa  resume_score  placed  half
0    24          6.52       1     0
1    22          5.17       0     0
2    24          8.86       1     0
3    22          7.27       1     0
4    23          7.30       1     0
5    24          6.19       1     0
6    21          7.09       0     0
7    22          6.29       0     0
8    22          6.71       0     0
9    23          7.12       1     0